#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dragon-ws/gh-action-local-k8s/runs/run-fWYZgjkC4dVkVd25

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.http.workstation-external-ip: Reading...
data.http.workstation-external-ip: Read complete after 0s [id=http://ipv4.icanhazip.com]
aws_iam_policy.eks_worknode_ebs_policy: Refreshing state... [id=arn:aws:iam::317884193661:policy/Amazon_EBS_CSI_Driver]
aws_iam_role.demo-cluster: Refreshing state... [id=terraform-eks-demo-cluster]
aws_iam_role.demo-node: Refreshing state... [id=terraform-eks-demo-node]
data.aws_availability_zones.available: Reading...
aws_ecr_repository.isolates-repo: Refreshing state... [id=isolates]
aws_vpc.demo: Refreshing state... [id=vpc-02679ecc9c3769b3d]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_iam_role_policy_attachment.demo-cluster-AmazonEKSClusterPolicy: Refreshing state... [id=terraform-eks-demo-cluster-20230222132023327800000006]
aws_iam_role_policy_attachment.demo-cluster-AmazonEKSVPCResourceController: Refreshing state... [id=terraform-eks-demo-cluster-20230222132023277700000001]
aws_iam_role_policy_attachment.demo-node-AmazonEKS_CNI_Policy: Refreshing state... [id=terraform-eks-demo-node-20230222132023324500000004]
aws_iam_role_policy_attachment.worknode-AmazonEBSCSIDriver: Refreshing state... [id=terraform-eks-demo-node-20230222132023283800000002]
aws_iam_role_policy_attachment.demo-node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=terraform-eks-demo-node-20230222132023290400000003]
aws_iam_role_policy_attachment.demo-node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=terraform-eks-demo-node-20230222132023327600000005]
aws_internet_gateway.demo: Refreshing state... [id=igw-0796b527b9cdd9295]
aws_subnet.demo[1]: Refreshing state... [id=subnet-095da3d61bf40aa06]
aws_subnet.demo[0]: Refreshing state... [id=subnet-0bf2da9a02d921524]
aws_security_group.demo-cluster: Refreshing state... [id=sg-05957a5283c216aeb]
aws_security_group_rule.demo-cluster-ingress-workstation-https: Refreshing state... [id=sgrule-1739417432]
aws_route_table.demo: Refreshing state... [id=rtb-07bc37fca36e9ddd6]
aws_eks_cluster.demo: Refreshing state... [id=local-k8s]
aws_route_table_association.demo[1]: Refreshing state... [id=rtbassoc-0591ce42d90a53b87]
aws_route_table_association.demo[0]: Refreshing state... [id=rtbassoc-0967ae7dd7781d219]
aws_eks_addon.addons["aws-ebs-csi-driver"]: Refreshing state... [id=local-k8s:aws-ebs-csi-driver]
aws_eks_node_group.demo: Refreshing state... [id=local-k8s:demo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.cloudwatch_logs_readonly will be created
  + resource "aws_iam_policy" "cloudwatch_logs_readonly" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CloudWatchLogsReadOnly"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:GetLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.grafana_cloudwatch_role will be created
  + resource "aws_iam_role" "grafana_cloudwatch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "grafana.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "grafana-cloudwatch-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cloudwatch_logs_readonly_attachment will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_logs_readonly_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "grafana-cloudwatch-role"
    }

  # aws_security_group_rule.demo-cluster-ingress-workstation-https must be replaced
-/+ resource "aws_security_group_rule" "demo-cluster-ingress-workstation-https" {
      ~ cidr_blocks              = [ # forces replacement
          - "3.80.117.218/32",
          + "18.232.170.98/32",
        ]
      ~ id                       = "sgrule-1739417432" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @kofikodie, Action: `pull_request`*